export const choicesPage2 = [
  "หนาปิดมิดจนฉันหา ทางออกไม่ได้",
  "จางๆพอมีแสงรำไรให้เห็นอยู่บ้าง",
];

export const choicesPage6 = [
  "สีเหลืองแห่งความสุข (joy)",
  "สีม่วงน่าประหลาดใจ (surprise)",
  "สีฟ้าดูเศร้าซึม (sadness)",
  "สีแดงแห่งความโกรธ (anger)",
  "สีส้มปนความกลัว (fear)",
  "สีเขียวน่าขยะแขยง (disgust)",
];

export const choicesPage6ToColor = [
  "yellow_loop",
  "purple_loop",
  "blue_loop",
  "red_loop",
  "orange_loop",
  "green_loop",
];

export const choicesPage7 = [
  "ทั่วร่างกายของฉัน",
  "บนหัวของฉัน",
  "ตรงหัวใจของฉัน",
  "ปลายมือและเท้า",
];

export const choicesPage22 = [
  "ตื่นเต้นและชอบมันมากเลย",
  "ก็เพลินดีนะ น่าจะต้องฝึกอีกนิด",
  "ก็ไม่ได้แย่นะ แต่ยังไม่ได้ขนาดนั้นอะ",
];

export const choicesPage23 = ["สบายมาก!", "เหนื่อยๆนิดนึง แต่ยังไหวอยู่!"];

export const choicesPage20 = [
  "ยอดเยี่ยมไปเลย! ฉันอยากลองปั้นต่อไปอีกนะ",
  "แกล้งเธอก็สนุกดีนะ แต่มันยากจังเลย",
  "มันเลอะอะ ไม่น่าใช่ทางของฉันเท่าไหร่นะ",
];

export const choicesPage31 = [
  "ภาพวาดหลากหลาย",
  "รูปปั้นจากหลายอารมณ์",
  "กลุ่มคนเต้นพร้อมเสียงเพลง",
  "บทกวีที่สวยงาม",
];

export const colorToResult = [
  {
    color: "สีเหลือง",
    text: "คุณเป็นคนร่าเริง สนุกสนาน ใครอยู่ใกล้ก็พลอยมีความสุขไปด้วย มีนิสัยสนุกเมื่อได้เรียนรู้อะไรใหม่ๆ มักชอบผจญภัย คุณชอบแสวงหาความแปลกใหม่และค้นหาตัวเองอยู่เสมอ รอบรู้ช่างจินตนาการ มีความเป็นศิลปินสูง",
    photo: "Yellow",
  },

  {
    color: "สีม่วง",
    text: "คุณช่างมีความคิดสร้างสรรค์ ทำให้ผู้อื่นรู้สึกแปลกใจได้เสมอ เวลาว่างหรือเครียดมักจะนำศิลปะมาชำระสิ่งที่ทำให้คุณกังวลอยู่ออกไป",
    photo: "Purple",
  },

  {
    color: "สีฟ้า",
    text: "ช่วงนี้อาจมีเรื่องที่คุณหนักใจหรือเศร้าหมองลงไปบ้าง คุณอาจต้องคิดเยอะกว่าปกติ แต่ความใจเย็นและสุขุมของตัวคุณเองจะพาคุณผ่านมันไปได้นะ",
    photo: "Blue",
  },
  {
    color: "สีแดง",
    text: "ความทะเยอทะยานและพลังในตัวคุณ ทำให้คุณสามารถพิชิตอุปสรรคและสิ่งที่ยากในชีวิตมาได้ ความอบอุ่นในใจคุณที่มีต่อคนรอบข้างอาจพัฒนามาเป็นแรงโทสะและความฉุนเฉียวได้ในเวลาที่ยากเย็น",
    photo: "Red",
  },
  {
    color: "สีส้ม",
    text: `สีแห่งความเบิกบานและความรื่นเริงเป็นความรู้สึกที่อิสระและได้รับการปลดปล่อย ละวางจากความสงสารหรือสมเพชตนเอง ลดการเห็นแก่ตัว
	และยินดีที่จะให้หรือแบ่งปัน เป็นความรู้สึกที่เกิดจากก้นบึ้งของจิตใจที่ต้องการปรับปรุงชีวิตให้สดใส สีส้มเป็นสีแห่งความสร้างสรรค์ อบอุ่นสดใสมีสติปัญญา
	เต็มเปี่ยมไปด้วยการทะเยอทะยาน มีพลัง แต่ก็มีการระมัดระวังตน 
	`,
    photo: "Orange",
  },
  {
    color: "สีเขียว",
    text: "คุณเป็นคนร่าเริง สนุกสนาน ใครอยู่ใกล้ก็พลอยมีความสุขไปด้วย มีนิสัยสนุกเมื่อได้เรียนรู้อะไรใหม่ๆ มักชอบผจญภัย คุณชอบแสวงหาความแปลกใหม่และค้นหาตัวเองอยู่เสมอ รอบรู้ช่างจินตนาการ มีความเป็นศิลปินสูง",
    photo: "Green",
  },
];

export const choicesPage31ToResult = [
  {
    topic: "พู่กัน",
    text: "จากความตื่นเต้นของคุณตอนได้ลองวาดภาพเมื่อครู่ คุณชอบมันเป็นพิเศษใช่ไหมล่ะ หมอกแห่งอารมณ์ฝากพู่กันวิเศษนี้ไว้ให้กับคุณ เผื่อคุณจะได้ลองใช้มันดูสักครั้งเพื่อสร้างสรรรค์ภาพวาดของคุณในอนาคต พู่กันวิเศษนี้จะเป็นเพื่อนคู่ใจในการเดินทางนี้ หวังว่าจะชอบมันนะ",
    photo: "Brush",
  },
  {
    topic: "ฟองน้ำ",
    text: "จากความตื่นเต้นของคุณตอนได้ลองขึ้นรูปปั้นเมื่อครู่ คุณชอบมันเป็นพิเศษใช่ไหมล่ะ? หมอกแห่งอารมณ์ฝากพู่กันฟองน้ำนี้ไว้ให้กับคุณ เผื่อคุณจะได้ลองใช้มันดูสักครั้งเพื่อสร้างสรรรค์งานปั้นของคุณในอนาคต ฟองน้ำวิเศษนี้จะเป็นเพื่อนคู่ใจในการเดินทางนี้ หวังว่าจะชอบมันนะ",
    photo: "Sponge",
  },
  {
    topic: "แผ่นแสียง",
    text: "จากความตื่นเต้นของคุณตอนได้ลองเต้นในวงแสดงเมื่อครู่ คุณชอบมันเป็นพิเศษใช่ไหมล่ะ? หมอกแห่งอารมณ์ฝากแผ่นเสียงวิเศษนี้ไว้ให้กับคุณ เผื่อคุณจะ้ลองใช้มันดูสักครั้งเพื่อสร้างสรรรค์การแสดงของคุณในอนาคต แผ่นเสียงวิเศษนี้จะเป็นเพื่อนคู่ใจในการเดินทางนี้ หวังว่าจะชอบมันนะ",
    photo: "Vinyl",
  },
  {
    topic: "กระดาษ",
    text: "จากความตื่นเต้นของคุณตอนได้ลองแต่งกลอนเมื่อครู่ คุณชอบมันเป็นพิเศษใช่ไหมล่ะ? หมอกแห่งอารมณ์ฝากกระดาษวิเศษนี้ไว้ให้กับคุณ เผื่อคุณจะได้ลองใช้มันดูสักครั้งเพื่อสร้างสรรรค์ภาพวาดของคุณในอนาคต กระดาษวิเศษนี้จะเป็นเพื่อนคู่ใจในการเดินทางนี้ หวังว่าจะชอบมันนะ",
    photo: "Paper",
  },
];

export function getUserChoice(page: number) {
  const userChoice = window.localStorage.getItem(`userChoicePage${page}`);
  return Number(userChoice);
}
