import React from "react";
import { VStack } from "@components/common";
import DescriptionContent from "./DescriptionContent";

const Description = () => {
  return (
    <VStack
      sx={{
        gap: {
          xs: "30px",
          md: "65px",
        },
      }}
    >
      <DescriptionContent
        subTopic="VALUE"
        text="Artspect มุ่งหวังที่จะแนะนำคุณตลอดการเดินทางในการสำรวจตนเองโดยใช้ศิลปะเป็นเครื่องมือ พวกเราหวังให้ผู้คนได้หยุดพักช่วงสั้นๆ ในตารางงานที่ยุ่งเพื่อสำรวจดูจิตใจของตนเอง ทั้งด้านร่างกายและอารมณ์ ไตร่ตรองดู และเข้าใจว่าตอนนี้กำลังรู้สึกอย่างไร เรายินดีต้อนรับและเชิญทุกคนเข้าร่วมกับเราในการเดินทางครั้งนี้"
      />
      <DescriptionContent
        subTopic="PURPOSE"
        text="พวกเราสนับสนุนให้ทุกคนร่วมกันรังสรรค์งานศิลปะผ่านความรู้สึก โดยเราจะทำการเปิดนิทรรศการสำหรับการจัดแสดงผลงานศิลปะที่มาจากทุกคน และระหว่างการเดินทางครั้งนี้ พวกเราหวังว่าจะเป็นส่วนหนึ่งที่ช่วยสนับสนุนให้ทุกคนกล้าที่จะแสดงออกทางอารมณ์ของตนเองมากขึ้นและหวังว่าพวกเราจะเป็นหนึ่งในแรงบันดาลใจให้ผู้คนได้ฝึกฝนแสดงอารมณ์อย่างต่อเนื่องจนกลายเป็นความเคยชินอีกด้วย"
      />
    </VStack>
  );
};

export default Description;
